tutorials/rheoInterFoam/ImpactingDrop/Oldroyd-BLog/0/U.org
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Website:  https://openfoam.org                  |
|   \\  /    A nd           | Version:  9                                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    atmosphere
    {
       type            zeroGradient;
    }
    plate
    {
       type            fixedValue;
       value           uniform (0 0 0);
    }
    wFront
    {
	type            wedge;     
    }
    wBack
    {
	type            wedge;     
    }
    axis
    {
	type            empty;     
    }
}

// ************************************************************************* //
